# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [2]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Use head method to see first rows:

In [3]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

### Info on Unique Values

In [4]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
df['col2'].nunique()

3

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [10]:
#Select from DataFrame using criteria from multiple columns
df[(df["col1"] > 2) & (df["col2"] >500)]

   col1  col2 col3
2     3   666  ghi

In [7]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Applying Functions

In [11]:
def times2(x):
    return x*2 + 2

In [19]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [20]:
df["col1"].apply(times2)

0     4
1     6
2     8
3    10
Name: col1, dtype: int64

In [22]:
df["col4"] = df["col2"].apply(lambda x:x**2)

In [23]:
df

   col1  col2 col3    col4
0     1   444  abc  197136
1     2   555  def  308025
2     3   666  ghi  443556
3     4   444  xyz  197136

** Permanently Removing a Column using del**

In [24]:
df

   col1  col2 col3    col4
0     1   444  abc  197136
1     2   555  def  308025
2     3   666  ghi  443556
3     4   444  xyz  197136

In [25]:
del df["col1"]

In [26]:
df

   col2 col3    col4
0   444  abc  197136
1   555  def  308025
2   666  ghi  443556
3   444  xyz  197136

** Get column and index names: **

In [29]:
df.columns

Index(['col2', 'col3', 'col4'], dtype='object')

In [30]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Find Null Values or Check for Null Values**

In [31]:
df.isnull()

    col2   col3   col4
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Reshaping table

In [32]:
data = {'Team':['A','A','A','B','B','B'],
     'Stage':['Bachelor','PhD','Master','Bachelor','Master','PhD'],
       'Sex':['Male','Male','Female','Female','Male','Male'],
       'X':[10,32,21,50,24,19]}

In [33]:
df = pd.DataFrame(data)

In [34]:
df

  Team     Stage     Sex   X
0    A  Bachelor    Male  10
1    A       PhD    Male  32
2    A    Master  Female  21
3    B  Bachelor  Female  50
4    B    Master    Male  24
5    B       PhD    Male  19

In [38]:
pd.pivot_table(df,values="X",index=["Team","Stage"],columns="Sex")

Sex            Female  Male
Team Stage
A    Bachelor     NaN  10.0
     Master      21.0   NaN
     PhD          NaN  32.0
B    Bachelor    50.0   NaN
     Master       NaN  24.0
     PhD          NaN  19.0